#include "generator.hpp"

#include <chrono>
#include <fstream>
#include <iostream>



عدد_صحيح DMX_Generator(معيار::سلسلة اسم_الملف, معيار::المتجه<معيار::المتجه<معيار::المتجه<عدد_صحيح>>> مصفوفة) {
//يجب أن تكون أسماء الوظائف وجميع إخراج النص باللغة الإنجليزية

	معيار::سلسلة اسم_الخالق;
	معيار::ج_خارج << "Enter your name: ";
	الحصول_على_خط(معيار::ج_في, اسم_الخالق);

	لو(اسم_الخالق.مقاس() < _١ || اسم_الخالق.مقاس() > _٧*_٧+_١) {
		معيار::ج_خطأ << "Name must be between 1 and 50 characters (inclusive) in length" << خط_جديد;
		يعود _١;
	}

	خلال(حرف ح : اسم_الخالق) {
		لو(جامد_صب<لم_يتم_توقيعه حرف>(ح) > _٧*_٩*_٢+_١) {
			معيار::ج_خطأ << "Name must consist of ASCII characters only" << خط_جديد;
			يعود _١;
		}
	}
	
	اسم_الخالق.قم_بتغيير_المقاس(_٨*_٧+_١, باطل_حرف);



	معيار::دفق_ملف_الإخراج ملف(اسم_الملف, معيار::الداخل_الخارج_تدفق::الثنائية);
	لو(!ملف.مفتوح()) {
		معيار::ج_خطأ << "Failed to create file: " << اسم_الملف << خط_جديد;
		يعود _١;
	}



	اثنان_و_ثلاثون_عدد_صحيح الطابع_الزمني = جامد_صب<اثنان_و_ثلاثون_عدد_صحيح>(
		معيار::كرونو::مدة_صب<معيار::كرونو::ثوان>(
			معيار::كرونو::ساعة_النظام::الآن().الوقت_منذ_فترة()
		).عدد()
	);

	ملف.يكتب(
		إعادة_التفسير_صب<ثابت حرف*>(&الطابع_الزمني),
		حجم(الطابع_الزمني)
	);



	ثمانية_عدد_صحيح_لم_يتم_توقيعه عرض	= مصفوفة[_٠][_٠].مقاس();
	ثمانية_عدد_صحيح_لم_يتم_توقيعه الارتفاع	= مصفوفة[_٠].مقاس();
	ثمانية_عدد_صحيح_لم_يتم_توقيعه عمق	= مصفوفة.مقاس();



	ملف.يكتب(إعادة_التفسير_صب<ثابت حرف*>(&عرض), حجم(ثمانية_عدد_صحيح_لم_يتم_توقيعه));
	ملف.يكتب(إعادة_التفسير_صب<ثابت حرف*>(&الارتفاع), حجم(ثمانية_عدد_صحيح_لم_يتم_توقيعه));
	ملف.يكتب(إعادة_التفسير_صب<ثابت حرف*>(&عمق), حجم(ثمانية_عدد_صحيح_لم_يتم_توقيعه));
	ملف.يكتب(اسم_الخالق.ج_سلسلة(), اسم_الخالق.مقاس());



	خلال(نوع_الحجم شريحة = _٠; شريحة < عمق; شريحة++) {
		خلال(نوع_الحجم صف = _٠; صف < الارتفاع; صف++) {
			خلال(نوع_الحجم عمود = _٠; عمود < عرض; عمود++) {
				ملف.يكتب(
					إعادة_التفسير_صب<ثابت حرف*>(
						جامد_صب<اثنان_و_ثلاثون_عدد_صحيح*>(
							&(مصفوفة[شريحة][صف][عمود])
						)
					),
					حجم(اثنان_و_ثلاثون_عدد_صحيح)
				);
			}
		}
	}

	ملف.غلق();

	يعود _٠;
}

